# Import Modules

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.1.4'

# Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0         11.0         18
1         10.0          6
2          8.0         17
3          3.0         13
4          2.0          4

In [5]:
# df.index = pd.util.testing.makeDataIndex(n_rows, freq='H')
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00         11.0         18    A
1 2023-10-01 01:00:00         10.0          6    B
2 2023-10-01 02:00:00          8.0         17    C
3 2023-10-01 03:00:00          3.0         13    D
4 2023-10-01 04:00:00          2.0          4    E

In [6]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih kolom bertipe data numerik

In [7]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         11.0         18
1         10.0          6
2          8.0         17
3          3.0         13
4          2.0          4

In [8]:
df.select_dtypes(include='float')

   bil_pecahan
0         11.0
1         10.0
2          8.0
3          3.0
4          2.0

In [9]:
df.select_dtypes(include='int')

   bil_bulat
0         18
1          6
2         17
3         13
4          4

# Memilih kolom bertipe data string atau object

In [10]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data datetime

In [11]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [12]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         11.0         18    A
1         10.0          6    B
2          8.0         17    C
3          3.0         13    D
4          2.0          4    E